# -*- coding: utf-8 -*-
# @Author   : 王翔
# @微信号   : King_Uranus
# @公众号    : 清风Python
# @GitHub   : https://github.com/BreezePython
# @Date     : 2019/11/12 22:32
# @Software : PyCharm
# @version  ：Python 3.7.3
# @File     : Enneagram_Exam.py


Exam = [
    """
    1.服务他人、 因应他人的需求，对我而言是重要的
    2.寻求看待事物和做事的各种方法，对我而言是重要的 
    """, """ 
    1.面对困扰时，我会陷在里面
    2.面对困扰时，我会想办法放轻松  
    """, """  
    1.我向来认为自己是个平静的、 
    2.随和的人我向来认为自己是个严肃的、 自律的人 
    """, """ 
    1.我喜欢社交生活且喜欢结识各样的朋友
    2.我对社交生活不感兴趣，而且怕与人交往 
    """, """ 
    1.做决定对我而言通常很困难
    2.做决定对我而言很少有困难  
    """, """ 
    1.我向来是愿意支持他人，为他人付出，喜欢有人为伴的
    2.我向来是严肃的、 克制的、 喜欢讨论问题  
    """, """ 
    1.面对全新的经验时，我通常会自问这是否精彩、 有用
    2.面对全新的经验时，我通常会自问这是否好玩、 有趣 
    """, """  
    1.我主要的长处之一是主导各种情况的能力
    2.我主要的长处之一是描述内在状态的能力 
    """, """ 
    1.大体而言，我太开放、 天真  
    2.大体而言，我太机警、 谨慎 
    """, """ 
    1.我认为做事的方法有很多种的
    2.我认为做事的方法只有一种  
    """, """ 
    1.我的主要长处之一是利用资源及实现计划
    2.我的主要长处之一是提出新点子，使人们为之兴奋 
    """, """ 
    1.我的健康及幸福因我强烈的助人欲而受害
    2.我的人际关系因我强烈的自我而受害 
    """, """ 
    1.我向来有不易睡眠的困扰
    2.我向来能轻易入睡  
    """, """ 
    1.我一向做事欠缺信心而犹豫不决
    2.我一向做事充满信心当机立断  
    """, """ 
    1.人们信赖我，因为我有自信且能够为他们着想
    2.人们信赖我，因为我很公正且会做正确的事  
    """, """ 
    1.我通常专注于自己的情感，且喜欢让它一直持续下去
    2.我通常会淡化自己的情感，不会太注意它 
    """, """ 
    1.我或许一直都太被动、 不够投入
    2.我或许一直都有太强的支配欲和操作欲 
    """, """ 
    1.大体而言，我是有条理且审慎的
    2.大体而言，我是好刺激且愿意冒险的 
    """, """ 
    1.我倾向帮助别人而发现他们正在犯错
    2.我倾向和他人保持一定的距离 
    """, """ 
    1.我已提供许多人关怀与教养
    2.我已提供许多人方向与诱因  
    """, """ 
    1.我很以自己的毅力及常识为傲
    2.我很以自己的创新、 创造力为傲  
    """, """ 
    1.大体而言，我是个外向的、 擅社交的人
    2.大体而言，我是个认真的、 自律的人  
    """, """ 
    1.虽然对方没有提出要求，只要我觉得他们有所需要，我便毫不犹豫及主动地帮助他们。   
    2.若对方没有提出要求，我不会主主动地帮助他们 
    """, """ 
    1.通常能引起剧烈情绪震荡的情况都会吸引我 
    2.通常令我觉得平静、 舒适的情况都会吸引我  
    """, """ 
    1.由于想象力及好奇心，我的想法一向很有冒险性
    2.我的想法一向很实际，只尝试着推动事物 
    """, """ 
    1.驾驭及支配别人对我而言是较重要的
    2.受到别人的重视及认同对我而言是较重要的 
    """, """ 
    1.面临麻烦时，我有能力将之解决
    2.面临麻烦时，我会以自己喜欢的东西慰劳自己 
    """, """ 
    1.整体而言，我一直是凭直觉的、 个人主义的
    2.整体而言，我一直是非常有组织力的、 负责任的 
    """, """ 
    1.我因过于侵扰及干扰别人而产生人际关系的困扰
    2.我因过于逃避及沉默而产生人际关系的困扰 
    """, """ 
    1.我向来自信且喜欢与人比较
    2.我向来谦卑且喜欢以较慢的步伐行事 
    """, """ 
    1.我喜欢生活在自己的小世界里
    2.我喜欢让整个世界知道我的存在  
    """, """ 
    1.我常受紧张、 不安全感及疑虑的困扰。
    2.我常受愤怒、 理想主义及缺乏耐心的困扰  
    """, """  
    1.我向来以自己在别人生活中所扮演的重要角色为傲
    2.我向来以自己的风趣及对新事物的开放态度为傲 
    """, """ 
    1.我比较乐观且易于从挫折中恢复
    2.我常处于情绪化且多愁善感  
    """, """ 
    1.在许多状况下，我喜欢让自己就领导地位
    2.早许多状况下，我宁可让他人就领导地位 
    """, """ 
    1.我一向是专注且具有高度热衷
    2.我一向是很自发的，喜好玩乐的
    """
]
